Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/third_level_education/applying_to_college/third_level_courses_for_mature_students.html.txt.tmx
Source language: en
Languages: ga

source: Third-level courses for mature students
ga: Cúrsaí tríú-leibhéal do mhic léinn aibí

source: Third-level education is becoming increasingly accessible to adults on both a full-time and a part-time basis
ga: Tá sé ag éirí níos furasta i gcónaí do dhaoine fásta theacht ar oideachas tríú-leibhéal ar bhonn páirtaimseartha agus ar bhonn lánaimseartha

source: Third-level colleges reserve a small number of places specifically for mature students who want to participate in full-time day programmes
ga: Cuireann coláistí tríú leibhéal méid áirithe áiteanna ar leataobh do mhic léinn aibí atá ag iarraidh páirt a ghlacadh i gcláir lánaimseartha laethúil

source: If you are over 23* you can apply for one of these places
ga: Má tá tú thar aois 23* is féidir leat cur isteach ar cheann de na háiteanna seo

source: This means that you will compete for your place on a different basis to those who are just leaving school
ga: Ciallaíonn sé seo go mbeidh tú ag déanamh iomaíochta ar áit a fháil duit féin ar bhunús difríúil dóibh siúd atá ag fágáil na scoile

source: The number of places reserved for mature students are limited, however, so it is likely that you will still have to compete with your peers
ga: Tá teorainn ar an méid áit a chuirtear ar leataobh do mhic léinn aibí, áfach, agus mar sin d'fhéadfá a bheith san iomaíocht le do chomhaoisithe

source: *Generally,you are considered to be a mature student if you are at least 23 years of age on January 1 of the year you enter your course
ga: * De gnáth, tógtar gur mac léinn aibí thú má tá tú 23 bliain d'aois ar a laghad an 1 Eanáir don bhliain a thosnaíonn tú an cursa

source: If you are interested in a particular college you should check how it defines a mature student
ga: Má tá suim agat i gcoláiste áirithe, caithfidh tú an sainmhíniú mhac léinn a aimsigh

source: If you opt for a full-time course in this way, you will be expected to attend classes or lectures every day and you will be assessed in the same way as the other students on your course
ga: Má roghnaíonn tú cúrsa lánaimseartha a dhéanamh sa mbealach seo beidh ort freastal ar ranganna nó ar léachtaí chuile lá, agus measfar tú ar an mbealach céanna le na mic léinn eile ar do chúrsa

source: However, if the full-time model does not suit you, there are other options available, including part-time courses, modular programmes and distance learning
ga: Muna bhfeileann córas mar sin duit, áfach, tá fáil ar roghanna eile, cúrsaí páirtaimseartha, cláracha modúla agus cianoideachais san áireamh

source: If you choose to study on a part-time or modular basis, you can spread your studies over a number of years
ga: Má roghnaíonn tú staidéar a dhéanamh ar bhonn páirt-aimseartha nó modúla, is féidir leat a bheith ag staidéar thar tréimhse blianta níos faide

source: This gives you the opportunity to organise your time and to study in bursts when it is most convenient for you
ga: Tugann sé seo deis duit do chuid ama a eagrú agus diriú ar an staidéar nuair is fearr a fheileann duit féin

source: It has the obvious drawback that it will take longer to complete than a full-time course, but it also has the advantage that it allows you to work at your own pace, gradually building credits towards your qualification
ga: An mhíbhuntáiste is mó a bhaineann leis, ár ndóigh, ná go dtógfaidh sé achar níos faide ort an chúrsa a chríochnú, ach tá sé de bhuntáiste aige go dtugann sé cead duit a bheith ag obair ag do luas féin agus thú ag fáil do cháilíochtaí de réir a chéile

source: A modular programme is made up of separate modules, which are self-contained units within a course
ga: Tá clár modúla déanta suas de modúil difríochta, atá gach modúil neamhspleách ann féin taobh istigh den chúrsa

source: You can study and complete each module separately at different stages during that course
ga: Is féidir leat staidéar a dhéanamh ar gach modúil agus iad a chríochnú iontu féin ag amanna difriúla tríd an gcúrsa

source: Modular programmes can take place in regular classroom settings or can be part of a distance learning programme
ga: Is féidir cláranna modúla a rith i ghnáth sheomra ranga, nó mar chuid de chúrsa foghlama chianoideachais

source: The term distance learning covers a wide range of learning programmes that take place away from the physical presence of the classroom and the tutor
ga: Tá réimse leathan chláracha foghlama atá dhá teagasc taobh amuigh den seomra ranga agus gan teagascóir i láthair clúdaithe faoin téarma cianoideachas

source: If you participate in a distance learning programme, it is likely that you will use a wide range of packaged materials and media throughout your course
ga: Má tá tú ag glacadh páirt i gclár chianoideachais, tá gach seans ann go mbainfidh tú úsaid as réimse leathain de pacáistí ábhair agus ilmheáin tríd an gcúrsa. D'fhéadfadh téipeanna, físeanna agus úsáid an idirlíne a bheith i gceist anseo

source: Some courses organise periodic classes where students come together for a day, a weekend or a week at a time, in order to study intensively
ga: Eagraíonn cuid de na cúrsaí ranganna ó am go chéile nuair a thagann mic léinn le chéile ar feadh tréimhse lae, nó seachtaine le tréanstaidéar a dhéanamh

source: University access programmes aim to increase the participation of under-represented groups at third-level
ga: Tá sé de chuspóir ag cláir rochtana ollscoile rannpháirtíocht grúpaí a ndéantar tearcionadaíocht dóibh ar thríú leibhéal a mhéadú

source: They do this by supporting young adults and mature students to study at third-level colleges
ga: Déanann siad amhlaidh trí thacú le daoine fásta óga agus mic léinn aibí chun staidéar a dhéanamh ag coláistí tríú leibhéal

source: Students attending access or foundation courses that are on the Department of Education’s approved list of post-leaving certificate courses may be eligible for funding under the Student Grant Scheme
ga: D’fhéadfadh mic léinn atá ag freastal ar chúrsaí rochtana nó bonnchúrsaí atá ar liosta cúrsaí iar-Ardteistiméireachta faofa na Roinne Oideachais a bheith incháilithe chun cistiú a fháil faoi Scéim um Dheontais do Mhic Léinn

source: However, students attending a foundation or access course in any other college or university will not be eligible for funding
ga: B’fhéidir nach mbeadh mic léinn a fhreastalaíonn ar bhonnchúrsa nó cúrsa rochtana in aon choláiste nó ollscoil eile, áfach, i dteideal cistiú a fháil

source: An access or foundation course is considered to be a second-level course for the Back to Education Allowance
ga: Meastar gur cúrsa dara leibhéal é cúrsa rochtana nó bonnchúrsa i dtaobh an Liúntais um Fhilleadh ar Oideachas

source: You should check your options around access programmes with the university of your choice or local Education and Training Board
ga: Ba cheart duit do chuid roghanna a sheiceáil maidir le cláir rochtana le do rogha ollscoile nó Bord Oideachais agus Oiliúna

source: Generally, you will need to have completed your Leaving Certificate
ga: Go ginearálta, beidh ort an scrúdú Ardteisteiméireachta a bheith déanta agat

source: However, if you are applying for a place as a mature student, you will not be asked to meet the usual entry requirements
ga: Má tá tú ag cur isteach ar áit mar mhac léinn aibí, ar ndóigh, ní iarrfar ort ghnáthchoinníollacha iontrála a chomhlíonadh

source: Different courses operate different entry procedures, but, in general, the colleges will take into account your educational background, work history, community involvement and other achievements and interests
ga: Tá riachtanais éagsúla ag na cúrsaí éagsúla, ach, go ginearálta tógfaidh na coláistí do chúlra oideachais, taithí oibre, obair don phobail agus na rudaí eile atá bainte amach agat, chomh maith lena hábhair a chuireann tú spéis iontu san áireamh

source: This system is known as the Accreditation of Prior Experiential Learning (APEL) or Recognition of Prior Learning (RPL)
ga: Tugtar Creidiúnú Réamhfhoghlama ó Thaithí (APEL) nó Aitheantas Réamhfhoghlama (RPL) ar an gcóras seo

source: It is useful to find out whether the college of your choice uses the APEL system before you apply
ga: Bheadh sé úsáideach a fhios a bheith agat an bhfuil an córas seo in úsáid ag an gcoláiste atá roghnaithe agat sula ndéanann tú iarratas a chur isteach

source: The Qualifax website has information about mature student entry requirements for full-time undergraduate courses
ga: Tá eolas faoi riachtanais iontrála do mhic léinn aibí ar shuíomh gréasáin Qualifax

source: In some cases, you may be asked to take an entrance exam
ga: I gcásanna áirithe d'fhéadfaí iarraidh ort scrúdú iontrála a dhéanamh

source: You will not have to pay fees in publically funded colleges if you qualify for the Free Fees Initiative
ga: Ní bheidh ort táillí a íoc i gcoláistí atá á gcistiú go poiblí má cháilíonn tú don Tionscnamh Saortháillí

source: However, you will have to pay the student contribution unless you also qualify for the student grant
ga: Beidh ort an ranníocaíocht mhac léinn a íoc, áfach, murar féidir leat cáiliú don deontas mac léinn

source: You should also find out if you qualify for the Back to Education Allowance
ga: Ba cheart duit a dheimhniú, chomh maith, an gcáilíonn tú don Liúntas um Fhilleadh ar Oideachas

source: If you are planning to study at a private third-level college, however, you will be charged fees
ga: Má tá sé i gceist agat staidéar a dhéanamh ag coláiste príobháideach tríú leibhéal, ar ndóigh, beidh táillí le n-íoc agat

source: These vary from college to college
ga: Tá éagsúlacht idir choláistí maidir lena gcuid táillí

source: You can apply for tax relief if you are paying for the course from your own income or another person can claim if they are paying fees on your behalf
ga: Is féidir leat iarratas a dhéanmah ar faoiseamh chánach má tá tú ag íoc ar an gcúrsa as d'ioncam féin, nó is féidir le do chéile éileamh a dhéanamh má tá sé/sí ag íoc thar do cheann

source: Part-time, modular and distance education
ga: Oideachas páirtaimseartha, modúla agus cianoideachais

source: You will have to pay fees for all part-time, modular and distance education courses
ga: Beidh ort táillí a íoc ar gach cúrsa páirtaimseartha, cúrsa modúla nó cúrsa cianoideachais

source: The costs vary from course to course
ga: Tá costais éagsúla ar na cúrsaí éagsúla

source: However, you may apply for tax relief if you are participating on an approved course
ga: Is féidir iarratas a dhéanamh, áfach, ar faoiseamh chánach a fháil má tá tú ag glacadh páirte i gcúrsa aitheanta ar feadh 2 bliana ar a laghad agus tú ag íoc as d'ioncam féin

source: In order to apply for a third-level course as a mature student, you should first contact the college of your choice directly and send them an up-to-date curriculum vitae (CV)
ga: Ba cheart duit teagmháil a dhéanamh díreach leis an gcoláiste atá roghnaithe agat, agus Curriculum Vitae (C.V.) suas chun dáta a chur chucu, chun iarratas a dhéanamh ar áit mar mac léinn aibí

source: Some colleges require you to apply through the Central Applications Office and you must apply before 1 February of the year you start your course
ga: I gcás coláistí áirithe bíonn ort iarratas a dhéanamh tríd an gcóras CAO

source: You will be in competition with other mature students for a place on the course so make sure to include as much detail as possible regarding your educational background, work experience and other interests
ga: Beidh tú san iomaíocht le mic léinn aibí eile agus mar sin bí cinnte go bhfuil do chúlra oideachais, taithí oibre agus na rudaí eile a chuireann tú suim iontu luaite go sonrach ann

source: If your CV gets through the first part of the application procedure, you will be called for interview
ga: Má théann do C.V. tríd an gcéad chuid den chóras cuirfear glaoch ort chuig agallamh

source: At this point, you may be asked to bring along work that shows your aptitude for the course in question or you may be required to sit an aptitude test
ga: Ag an bpointe seo d'fhéadfaí iarraidh ort sampla de do chuid oibre a thaispeánann do chumas i leith an chúrsa áirithe a thabhairt leat nó d'fhéadfaí iarraidh ort dul faoi scrúdú chumais

source: You can find detailed information about college requirements and supports for mature students in the Mature Student Directory of Irish Third-Level Institutions (pdf)
ga: Tá faisnéis faoi riachtanais agus tacaíocht do mhic léinn aibí sa Mature Students Directory of Irish Third-Level Institutions (pdf)
